Revit 2026 API

# RenderDuration Enumeration

---

An enumerated type containing possible duration types to do Raytracer render.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RenderDuration
```
```vb
Public Enumeration RenderDuration
```
```cpp
public enum class RenderDuration
```
```fsharp
type RenderDuration
```

| Member name | Value | Description |
| --- | --- | --- |
| ByLevel | 0 | Render by the defined iterations. |
| ByTime | 1 | Render by the defined time. |
| UntilSatisfactory | 2 | Render until satisfactory. |

#### Reference

Autodesk.Revit.DB Namespace